{
  "home.languages": "Sprachen",
  "translate.portuguese": "Portugiesisch",
  "translate.english": "Englisch",
  "translate.spanish": "Spanisch",
  "translate.french": "Französisch",
  "translate.german": "Deutsch",
  "translate.china": "Chinesisch",
  "homePage": "Startseite",
  "home.title": "Exoplaneten",
  "text": "Abschlussarbeit Projekt",
  "Home.message": "Willkommen bei Exoplanet-Finder",
  "join.form.name": "Vorname",
  "join.form.familyName": "Nachname",
  "join.form.email": "E-Mail",
  "join.form.password": "Passwort",
  "join.form.login": "Anmelden",
  "join.form.name.errorMessage": "Der Name ist erforderlich",
  "join.form.familyName.errorMessage": "Der Nachname ist erforderlich",
  "join.form.email.errorMessage": "Die E-Mail ist erforderlich und muss gültig sein",
  "join.form.password.errorMessage": "Das Passwort ist erforderlich und muss mindestens 10 Zeichen lang sein, einschließlich mindestens eines Großbuchstabens und eines Sonderzeichens.",
  "TelescópioKepler": "Kepler-Teleskop",
  "TelescópioTESS": "TESS-Teleskop",
  "TelescópioK2": "K2-Teleskop",
  "addArchive": "Fügen Sie eine Datei hinzu, um das Diagramm anzuzeigen",
  "notFoundTitle": "404 - Seite nicht gefunden",
  "notFoundMessage": "Entschuldigung, die von Ihnen gesuchte Seite existiert nicht.",
  "serverErrorTitle": "500 - Interner Serverfehler",
  "serverErrorMessage": "Entschuldigung, ein interner Serverfehler hat die Bearbeitung Ihrer Anfrage verhindert.",
  "tessCuriosity": "Interessante Fakten zum TESS-Teleskop",
  "tessSubtitle": "Das Weltraumteleskop für die Erforschung von Exoplaneten, bekannt als TESS, ist eine der aufregendsten und innovativsten Weltraummissionen der NASA. Es wurde am 18. April 2018 gestartet und hat hauptsächlich das Ziel, Exoplaneten zu entdecken. Aber abgesehen von dieser grundlegenden Mission hat TESS einige faszinierende Eigenschaften, die es zu einem wertvollen Beitrag zur Weltraumforschung machen:",
  "topic1": "1. Exoplanetenjäger-Observatorium:",
  "tessText1": "TESS wird oft als 'Exoplanetenjäger' bezeichnet, weil es die Fähigkeit hat, Planeten im Transit zu erkennen, wenn sie vor ihren Muttersternen vorbeiziehen und teilweise deren Licht blockieren. Dies ist eine entscheidende Technik zur Entdeckung von Exoplaneten.",
  "topic2": "2. Sternevielfalt:",
  "tessText2": "Kepler hat eine breite Palette von Sternen in seiner Suche nach Exoplaneten beobachtet, darunter Riesensterne, weiße Zwerge, junge Sterne und sogar Doppelsternsysteme, in denen zwei Sterne umeinander kreisen.",
  "topic3": "3. Entdeckung von Bewohnbaren Welten:",
  "tessText3": "Kepler entdeckte eine Reihe von Exoplaneten, die sich in der 'bewohnbaren Zone' ihrer Muttersterne befanden, wo die Bedingungen für flüssiges Wasser und möglicherweise Leben, wie wir es kennen, geeignet sein könnten.",
  "topic4": "4. Vielfalt der Größen:",
  "tessText4": "Die Entdeckungen von Kepler zeigen, dass Exoplaneten in einer breiten Palette von Größen vorkommen, von gasförmigen Riesen ähnlich Jupiter bis hin zu kleineren, erdähnlichen Gesteinsplaneten.",
  "topic5": "5. Eigenartige Exoplaneten:",
  "tessText5": "Kepler hat auch Exoplaneten in extrem schnellen Umlaufbahnen entdeckt, die in wenigen Stunden um ihre Sterne kreisen. Dies hat unser herkömmliches Verständnis der Planetenentstehung herausgefordert.",
  "tessText6": "Das Kepler-Teleskop mit seiner bahnbrechenden Suche nach Exoplaneten und seinen faszinierenden kosmischen Entdeckungen wird als Meilenstein in der Geschichte der Weltraumerkundung bleiben und neue Horizonte für unser Verständnis des weiten und vielfältigen Universums eröffnen, das uns umgibt.",
  "scatterPLotTitle": "Streudiagramm",
  "exoplanetFinderTitle": "Willkommen beim",
  "exoplanetFinderSubtitle": "Erforschung des weiten Universums",
  "exoplanetFinderDescription": "Diese Website wurde im Rahmen meiner Abschlussarbeit im Bereich Informatik erstellt und konzentriert sich auf die Analyse von Exoplaneten. Wir laden Sie ein, sie zu erkunden, indem Sie die oben und nebenstehenden Optionen verwenden!",
  "exoplanetFinderDevelopers": "Entwickler",
  "exoplanet-info.title": "Exoplaneten",
  "exoplanet-info.Subtitle": "Erforschung von Welten außerhalb unseres Sonnensystems",
  "exoplanet-info.section1": "Exoplaneten oder extrasolare Planeten sind Himmelskörper, die Sterne außerhalb unseres Sonnensystems umkreisen. Mit anderen Worten sind es Planeten, die nicht zu unserer kosmischen Nachbarschaft gehören und sich in fernen Sternensystemen befinden.",
  "exoplanet-info.section2": "Diese Exoplaneten sind zu einem bedeutenden Forschungsbereich in der Astronomie geworden. Die Suche nach Exoplaneten wird durch fortschrittliche Beobachtungstechniken und die Analyse von Daten von Weltraumteleskopen und Teleskopen auf der Erde durchgeführt.",
  "exoplanet-info.graph": "Lichtkurve",
  "exoplanet-info.section3": "Eine der häufigsten Methoden zur Entdeckung von Exoplaneten ist die Transitmethode. Bei dieser Methode beobachten Wissenschaftler eine vorübergehende Verringerung der Helligkeit eines Sterns, wenn ein Exoplanet vor ihm vorbeizieht. Diese vorübergehende Helligkeitsabnahme wird als Transit bezeichnet.",
  "exoplanet-info.section4": "Eine andere gängige Methode ist die Messung der radialen Geschwindigkeit, bei der Exoplaneten durch die geringfügige 'Schwankung', die sie in dem von ihnen umkreisten Stern verursachen, aufgrund der Gravitationskraft zwischen ihnen erkannt werden.",
  "exoplanet-info.section5": "Die Entdeckung und Erforschung von Exoplaneten ist eines der spannendsten Gebiete der modernen Astronomie. Sie bietet die Möglichkeit, unser Verständnis des Kosmos zu erweitern und grundlegende Fragen zur Existenz von Leben außerhalb der Erde zu beantworten.",
  "exoplanet-info.section6": "Mit kontinuierlich verbesserten Technologien und Forschungsmethoden ist es sehr wahrscheinlich, dass wir in der Zukunft viele weitere faszinierende Exoplaneten entdecken werden.",
  "AdaBoostClassifier": "AdaBoost-Klassifikator",
  "XGBoostClassifier": "XGBoost-Klassifikator",
  "SVMClassifier": "SVM-Klassifikator",
  "adaboost.subtitle": "Steigerung der Genauigkeit von Maschinellem Lernen mit AdaBoost",
  "adaboost.section1": "AdaBoost, eine beliebte Technik des Maschinellen Lernens aus der Boosting-Kategorie, kombiniert mehrere schwache Lernmodelle, um ein starkes und präzises Modell zu erstellen. Dieser Algorithmus trainiert die Prädiktoren sequenziell, wobei jeder darauf abzielt, die Fehler seines Vorgängers zu korrigieren. Das Besondere an AdaBoost liegt in seiner Fähigkeit, einen neuen Prädiktor zu verbessern, indem er den instanzierten Beispielen, die vom vorherigen Prädiktor falsch klassifiziert wurden, ein höheres Gewicht zuweist. Dies führt zu neuen Prädiktoren, die besonders geschickt darin sind, vergangene Fehler zu korrigieren. Praktisch kann jeder Maschinelles Lernen-Algorithmus als anfängliches schwaches Lernmodell verwendet werden, solange er Gewichte für die Beispiele im Trainingsdatensatz akzeptiert.",
  "adaboost.section2": "Der AdaBoost-Algorithmus beginnt mit der Zuweisung gleicher Gewichte an alle Proben. In jeder Iteration wird ein Entscheidungsbaum mit einer Tiefe von 1 erstellt, um die Daten zu klassifizieren. Das Gewicht des ausgewählten Baumes wird basierend auf dem Gesamtfehler berechnet und die Gewichte der Proben werden aktualisiert, wobei falsch klassifizierte Klassifizierungen ein höheres Gewicht erhalten. Anschließend wird ein neuer gewichteter Datensatz erstellt und der Vorgang wird wiederholt, bis die angegebene Anzahl von Iterationen erreicht ist. Schließlich wird der Wald von Entscheidungsbäumen verwendet, um Vorhersagen auf nicht gesehenen Daten zu treffen. Die Bäume werden basierend auf ihren Entscheidungen gruppiert und die endgültige Klassifizierung erfolgt durch die Summe der Gewichte der Bäume.",
  "xgboost.subtitle": "Steigerung des Maschinellen Lernens auf ein neues Niveau mit XGBoost",
  "xgboost.section1": "XGBoost, ein auf Entscheidungsbäumen basierender Maschinelles Lernalgorithmus mit Gradient-Boosting-Struktur, hat sich einen Namen gemacht, indem er das am häufigsten verwendete Vorhersagemodell in Datenwissenschaftswettbewerben wie Kaggle wurde. Während neuronale Netze ideal für unstrukturierte Daten wie Bilder und Texte sind, gelten Entscheidungsbäume wie XGBoost als am effektivsten für tabellarische Daten. Sein Aufstieg wurde durch seine Vielseitigkeit, Portabilität und Unterstützung für verschiedene Programmiersprachen vorangetrieben.",
  "xgboost.section2": "Entwickelt an der University of Washington von Tianqi Chen und Carlos Guestrin hat XGBoost Datenwissenschaftswettbewerbe revolutioniert und wird sowohl in der Industrie als auch in Open-Source-Projekten mit einer aktiven Community von Mitwirkenden auf GitHub weit verbreitet eingesetzt. Seine Wirksamkeit beruht auf der Fähigkeit, die Struktur des Gradient-Boostings zu optimieren, was zu überlegener Leistung bei geringerem Ressourcenverbrauch führt. Trotz seines Erfolgs hängt die Wahl des richtigen Algorithmus von verschiedenen Faktoren ab, darunter Rechenkosten, Implementierungszeitplan und Genauigkeit, und es gibt vielversprechende Alternativen in der Machine Learning-Forschung.",
  "xgboost.section3": "Obwohl XGBoost weiterhin führend ist, entwickelt sich die Machine Learning-Forschung ständig weiter, und Frameworks wie Microsoft Researchs LightGBM und Yandex Technology's CatBoost zeigen vielversprechendes Potenzial. Der Wettbewerb um Überlegenheit in Bezug auf Leistung, Flexibilität und Erklärbarkeit gegenüber XGBoost geht weiter, aber bis ein starker Konkurrent auftaucht, bleibt XGBoost der König der Machine Learning-Algorithmen.",
  "svm.subtitle": "Maximierung der Trennung im Maschinellen Lernen",
  "svm.section1": "Support Vector Machines (SVMs) sind weit verbreitete überwachte Lernmodelle für Klassifikation und Regression. Sie zeichnen sich dadurch aus, dass sie Hyperflächen im Merkmalsraum finden, die die Klassen der Daten am besten voneinander trennen. Dieser Algorithmus ist sowohl für die lineare Klassifikation als auch für die Handhabung hochdimensionaler Merkmalsräume effizient und ermöglicht eine effiziente Handhabung nichtlinearer Klassifikationen.",
  "svm.section2": "Die Essenz der Funktionsweise einer SVM besteht darin, nach der optimalen Trennungshyperfläche zu suchen. Hierbei werden verschiedene Szenarien berücksichtigt. Beispielsweise ist es wichtig, unter verschiedenen Trennungshyperflächen diejenige zu identifizieren, die die beste Trennung zwischen den Klassen bietet. Der Rand, der den Abstand zwischen der Trennungshyperfläche und dem nächstgelegenen Datenpunkt darstellt, spielt eine entscheidende Rolle bei der Auswahl der richtigen Trennungshyperfläche und gewährleistet so maximale Effizienz bei der Klassifikation der Klassen.",
  "svm.section3": "In Situationen, in denen mehrere Trennungshyperflächen die Klassen gut trennen, wird die Auswahl der richtigen Ebene entscheidend. In solchen Fällen ist die Berechnung der maximalen Marge, dh des größten Abstands zwischen der Trennungshyperfläche und den Datenpunkten, von entscheidender Bedeutung. Die Trennungshyperfläche mit der maximalen Marge wird als die am besten geeignete für die effektive Klassifikation der Klassen angesehen und gewährleistet eine optimale Trennung.",
  "home.page.init": "Start",
  "home.page.exoplanets": "Exoplaneten",
  "home.page.models": "Modelle",
  "home.page.telescopes": "Teleskope",
  "home.page.vision": "Vision",
  "telescope.tess.title": "Weltraum-Entdeckungen mit dem TESS-Teleskop",
  "telescope.tess.subtitle": "Erforschung neuer Welten und entfernter Sterne",
  "telescope.tess.section1.h2": "1. Das Auge der Exoplanetenjagd",
"telescope.tess.section1.p": "Das TESS-Teleskop ist ein echter Exoplanetenjäger, konzipiert, um Planeten zu erkennen, die vor ihren Wirtssternen vorbeiziehen. Es hat bereits zahlreiche Exoplaneten in seiner unermüdlichen Suche identifiziert.",
"telescope.tess.section2.h2": "2. Ein umfassender Blick auf den Himmel",
"telescope.tess.section2.p": "Eine der herausragenden Eigenschaften des TESS ist seine Fähigkeit, ausgedehnte Himmelsbereiche nach Planeten abzusuchen. Es teilt den Himmel in Sektoren auf und fotografiert jeden Sektor im Detail, was einen umfassenden Blick auf das Universum ermöglicht.",
"telescope.tess.section3.h2": "3. Variable Sterne und Supernovae",
"telescope.tess.section3.p": "Das TESS beschränkt sich nicht nur auf die Suche nach Exoplaneten. Es untersucht auch variable Sterne und explosive Ereignisse wie Supernovae, was zu unserem Verständnis darüber beiträgt, wie Sterne im Laufe der Zeit evolvieren und sich verändern.",
"telescope.tess.section4.h2": "4. Ein Blick über unser Sonnensystem hinaus",
"telescope.tess.section4.p": "Mit seinen Entdeckungen von Exoplaneten gewährt uns das TESS einen Einblick in ferne Welten, von denen einige möglicherweise Bedingungen für die Existenz von Leben bieten. Dies erweitert unsere Horizonte in der Suche nach außerirdischem Leben.",
"telescope.tess.section5.h2": "5. Technologische Innovation",
"telescope.tess.section5.p": "Das TESS verwendet modernste Technologie, einschließlich hochauflösender Kameras, um detaillierte Bilder des Weltraums aufzunehmen. Seine Mission ist ein Zeugnis für den Fortschritt der Raumfahrttechnologie.",
"telescope.tess.p": "Mit dem TESS-Teleskop erkunden wir die Grenzen des Universums, enthüllen kosmische Geheimnisse und erweitern unser Wissen über den unendlichen Raum.",
"telescope.k2.title": "Das Universum mit dem K2-Teleskop erkunden",
"telescope.k2.subtitle": "Entdecken Sie die Geheimnisse des Kosmos mit dieser erstaunlichen Weltraummission",
"telescope.k2.section1.h2": "1. Eine zweite Chance in den Sternen",
"telescope.k2.section1.p": "Das K2-Teleskop, ursprünglich Teil der Kepler-Mission, erlebte seine Wiedergeburt nach einem Ausfall der Gyroskope. Unter dem Namen K2 ehrt es Johannes Kepler, den berühmten Astronomen.",
"telescope.k2.section2.h2": "2. Entdeckung ferner Welten",
"telescope.k2.section2.p": "Das K2 war ein echter Exoplanetenjäger, mit über 350 Entdeckungen bis heute. Von Supererden bis zu Gasriesen hat es uns mit einer Vielzahl von Welten jenseits unseres Sonnensystems beschenkt.",
"telescope.k2.section3.h2": "3. Auf der Suche nach Bewohnbarkeit",
"telescope.k2.section3.p": "Eine der aufregendsten Missionen des K2 ist die Suche nach Exoplaneten in bewohnbaren Zonen, in denen das Leben gedeihen könnte. Seine Entdeckungen sind ein Meilenstein in der Erforschung außerirdischen Lebens.",
"telescope.k2.section4.h2": "4. Über die bekannten Grenzen hinaus",
"telescope.k2.section4.p": "Das K2 beschränkte sich nicht nur auf die Jagd nach Exoplaneten; es untersuchte Asteroiden, variable Sterne, Supernovae und Sternhaufen und bot einen umfassenden Überblick über das Universum.",
"telescope-kepler.title": "Das Universum mit dem Kepler-Teleskop erforschen",
"telescope-kepler.subtitle": "Das Universum erkunden, um ferne Planeten zu finden",
"telescope-kepler.section1.h2": "1. Jagd auf Exoplaneten",
"telescope-kepler.section1.p": "Das Kepler-Teleskop ist berühmt für seine Exoplanetenjagd. Es hat Tausende von Planeten entdeckt, die andere Sterne umkreisen, und damit die Vielfalt der Planeten in unserer Galaxie aufgedeckt.",
"telescope-kepler.section2.h2": "2. Die Transitmethode",
"telescope-kepler.section2.p": "Das Kepler-Teleskop verwendet die Transitmethode, um Exoplaneten zu entdecken. Es beobachtet die periodische Abnahme der Helligkeit eines Sterns, wenn ein Planet vor ihm vorbeizieht, was die Identifikation von Planeten ermöglicht, die um ihre Sterne 'tanzen'.",
"telescope-kepler.section3.h2": "3. Bewohnbare Welten",
"telescope-kepler.section3.p": "Zu den Entdeckungen des Kepler-Teleskops gehören Exoplaneten in bewohnbaren Zonen, in denen Bedingungen für Leben vorhanden sein könnten. Diese Entdeckungen beflügeln unsere Vorstellungskraft über die Möglichkeit von Leben an anderen Orten im Universum.",
"telescope-kepler.section4.h2": "4. Die Light Box",
"telescope-kepler.section4.p": "Das Kepler-Teleskop wurde entwickelt, um seine Kameras auf einer konstanten Temperatur zu halten. Es wird durch eine 'Lichtbox' geschützt, die die thermische Stabilität aufrechterhält und präzise Beobachtungen ermöglicht.",
"telescope-kepler.section5.h2": "5. Eine Mission, die alle Erwartungen übertrifft",
"telescope-kepler.section5.p": "Ursprünglich für eine 3,5-jährige Mission geplant, hat das Kepler-Teleskop alle Erwartungen übertroffen und über seine geplante Lebensdauer hinaus weiterhin erfolgreich gearbeitet. Seine Entdeckungen haben unser Verständnis des Universums revolutioniert.",
"telescope-kepler.section5.p2": "Dank des Kepler-Teleskops sind wir näher denn je daran, die Frage zu beantworten: 'Gibt es da draußen bewohnte Welten?'",
"Models": "Modelle",
"graphs": "Grafiken",
"table": "Tabelle",
"table.telescope": "Teleskop",
"search": "Suchen",
"DownloadData": "Daten herunterladen",
"vision-about": "Über",
"vision-about-title": "Vision",
"vision-about-subtitle": "Darstellungen im maschinellen Lernen",
"vision-about-sector1.p": "Im maschinellen Lernen bezieht sich der Begriff 'Vision' auf die Fähigkeit eines maschinellen Lernmodells, 'sehen' und Muster in Eingabedaten zu interpretieren. Dies ist besonders relevant für Aufgaben im Bereich der Computer Vision, bei denen das Ziel darin besteht, bedeutende Informationen aus Bildern oder Videos zu extrahieren. Es gibt globale und lokale Ansichten von Daten, die in den nächsten Abschnitten behandelt werden.",
"vision-about-sector2.p": "Häufig wird die strategische Kombination dieser Ansätze in Anwendungen der Computer Vision eingesetzt, um die präzise Interpretation komplexer visueller Daten zu maximieren. Diese Synergie zwischen globaler und lokaler Vision spielt eine entscheidende Rolle in der Fähigkeit von maschinellen Lernmodellen, Informationen visueller Art in einer Vielzahl von Kontexten zu verstehen und zu verarbeiten.",
"global-subtitle": "Überblick über die Daten",
"global-section1.p": "Die globale Vision im maschinellen Lernen konzentriert sich auf die Identifizierung umfassender Muster und Merkmale in einem Bild oder Datensatz. Dieser Ansatz zielt darauf ab, hochrangige Informationen wie Konturen, Formen und vorherrschende Texturen zu extrahieren, um ein allgemeines Verständnis der Szene zu ermöglichen.",
"global-section2.p": "Durch die Konzentration auf umfassendere Merkmale sind Modelle, die die globale Vision verwenden, tendenziell weniger empfindlich gegenüber spezifischen Details oder subtilen Variationen in den Daten. Dies macht sie besonders nützlich für Aufgaben, die eine umfassendere Wahrnehmung der Umgebung erfordern, wie die Erkennung von Objekten in komplexen Bildern.",
"global-section3.p": "Unsere globalen Visionanalysen der Lichtkurven umfassen insgesamt 2001 Punkte, was mehr als die lokale Vision ist, um eine umfassendere Analyse des planetarischen Transits zu ermöglichen.",
"local-subtitle": "Spezifische Datenansicht",
"local-section1.p": "Die lokale Vision im maschinellen Lernen konzentriert sich auf spezifische Details und Merkmale auf niedriger Ebene in einem Bild. Dieser Ansatz zielt darauf ab, feine Elemente wie klare Kanten, kleine Texturen oder distinctive Pixelmuster zu identifizieren.",
"local-section2.p": "Durch die detaillierte Analyse spezifischer Teile des Bildes sind Modelle, die die lokale Vision verwenden, äußerst empfindlich gegenüber geringfügigen Variationen in den Daten. Dies macht sie besonders effektiv für Aufgaben, die ein detailliertes Verständnis der Struktur des Bildes erfordern, wie die Erkennung spezifischer Merkmale oder die Segmentierung von Objekten in einer Szene. Für die lokale Vision verwenden wir eine feste Größe von 201 Punkten für die Lichtkurven.",
"vision-modal-input-file": "Vision",
"modal-show-info-model": "Bewertungsmetriken:",
"modal-show-info-model-matriz": "KONFUSIONSMATRIX",
"modal-show-info-model-metricas": "METRIKEN",
"select-model-search": "Suchen",
"select-model-models": "Modell",
"select-model-vision": "Vision",
"select-model-telescope": "Teleskop",
"select-model-targets": "Ziele",
"select-model-info": "Metriken",
"select-model-clean": "Löschen",
"select-model-submit": "Ausführen",
"select-mode-table-model": "Modell",
"select-mode-table-vision": "Vision",
"select-mode-table-telescope": "Teleskop",
"select-mode-table-prob": "Wahrscheinlichkeit",
"select-mode-table-graph": "Grafik",
"modal-about-models-title": "Informationen",
"modal-about-models-subtitle": "Über die Seite",
"modal-about-models-section-p1": "Diese Seite wird verwendet, um Vorhersagen für ausgewählte Kandidaten im Feld zu treffen.",
"modal-about-models-section-p2": "Es ist auch möglich, vortrainierte Modelle auszuwählen, indem Sie die richtige Vision auswählen, wenn Sie einfügen, um Fehlfunktionen auf der Plattform zu vermeiden.",
"modal-about-models-section-p3": "Jede Vorhersage zeigt die Wahrscheinlichkeit an, dass es sich um einen Exoplaneten handelt, zusammen mit einem Diagramm, das die Lichtkurve des Kandidaten zeigt.",
"modal-about-graph-title": "Informationen",
"modal-about-graph-subtitle": "Über die Seite",
"modal-about-graph-section-p1": "Diese Seite enthält grafische Analysen zu den Kandidaten für Exoplaneten.",
"modal-about-graph-section-p2": "Sie können eine beliebige Beobachtung auswählen, und es werden verschiedene Diagramme dazu generiert.",
"graph-page-obs": "Beobachtungen",
"graph-page-select-telescope": "Wählen Sie das Teleskop aus",
"graph-page-select-candidates?": "Möchten Sie Kandidaten auswählen?",
"clean": "Löschen",
"about-graph": "Über die Grafikseite",
"about-candidates": "Die Beobachtungen wurden an Orten durchgeführt, an denen die Möglichkeit eines Exoplaneten besteht oder nicht.",
"about-page": "Über die Seite",
"insert": "Einfügen",
"modal-about-tables-text1": "Diese Seite zeigt eine Stichprobe der Datenbank jedes Teleskops mit 400 Zeilen, wobei jede Spalte und ihr entsprechender Wert dargestellt sind.",
"modal-about-tables-text2": "Wenn Sie auf die vollständige Datenbank zugreifen möchten, können Sie einfach auf die Download-Schaltfläche klicken, um alle Tausende von Zeilen verfügbar zu machen.",
"title-select-sector": "Wählen Sie den gewünschten Sektor aus:",
"observationsCount": "Anzahl der Beobachtungen",
"sector": "Sektor",
"observationMission": "Name der Mission, die die Beobachtung durchgeführt hat",
"authors": "Autoren",
"global": "Global",
"local": "Lokal",
"abaut": "Über",
"closeDialog": "Schließen",
"Targets": "Ziele",
"InsertModel": "Modell einfügen",
"info": "Über die Modelleite",
"about-pagee": "Über die Tabellenseite"
}
