{
  "home.languages": "Languages",
  "translate.portuguese": "Portuguese",
  "translate.english": "English",
  "translate.spanish": "Spanish",
  "translate.french": "French",
  "translate.german": "German",
  "translate.china": "Chinese",
  "homePage": "Home Page",
  "home.title": "Exoplanets",
  "text": "Thesis Project",
  "Home.message": "Welcome to Exoplanet-Finder",
  "join.form.name": "Name",
  "join.form.familyName": "Last Name",
  "join.form.email": "Email",
  "join.form.password": "Password",
  "join.form.login": "Sign Up",
  "join.form.name.errorMessage": "Name is required",
  "join.form.familyName.errorMessage": "Last name is required",
  "join.form.email.errorMessage": "Email is required and must be valid",
  "join.form.password.errorMessage": "Password is required and must have at least 10 characters, including at least one uppercase letter and one special character.",
  "TelescópioKepler": "Kepler Telescope",
  "TelescópioTESS": "TESS Telescope",
  "TelescópioK2": "K2 Telescope",
  "addArchive": "Add a file to view the chart",
  "notFoundTitle": "404 - Page not found",
  "notFoundMessage": "Sorry, the page you are looking for does not exist.",
  "serverErrorTitle": "500 - Internal Server Error",
  "serverErrorMessage": "Sorry, an internal server error occurred that prevented your request from being completed.",
  "tessCuriosity": "Curiosities about the TESS Telescope",
  "tessSubtitle": "The Transiting Exoplanet Survey Satellite, or TESS, is one of NASA's most exciting and innovative space missions. Launched on April 18, 2018, TESS's primary mission is to discover exoplanets. But beyond this core mission, TESS has several fascinating curiosities that make it a valuable asset in space exploration:",
  "topic1": "1. Exoplanet Hunting Observatory:",
  "tessText1": "TESS is often called the 'exoplanet hunter' for its ability to detect planets in transit, meaning when they pass in front of their host stars, partially blocking their light. This is a crucial technique for finding exoplanets.",
  "topic2": "2. Stellar Diversity:",
  "tessText2": "Kepler observed a wide range of stars in its quest for exoplanets, including red giants, white dwarfs, young stars, and even binary star systems, where two stars orbit one another.",
  "topic3": "3. Discovering Habitable Worlds:",
  "tessText3": "Kepler discovered a number of exoplanets that orbited in the 'habitable zone' of their parent stars, where conditions could be suitable for the presence of liquid water and possibly life as we know it.",
  "topic4": "4. Variety of Sizes:",
  "tessText4": "Kepler's findings showed that exoplanets come in a wide range of sizes, from Jupiter-like gas giants to smaller, Earth-like rocky planets.",
  "topic5": "5. Mischievous Exoplanets:",
  "tessText5": "Kepler also detected exoplanets on extremely fast orbits, completing orbits around their stars in a matter of hours. This challenged our conventional understanding of planet formation.",
  "tessText6": "The Kepler Telescope, with its pioneering search for exoplanets and its fascinating cosmic discoveries, will remain a milestone in the history of space exploration, opening new horizons for our understanding of the vast and diverse universe that surrounds us.",
  "scatterPLotTitle": "Scatter Plot",
  "exoplanetFinderTitle": "Welcome to",
  "exoplanetFinderSubtitle": "Exploring the Vast Universe",
  "exoplanetFinderDescription": "This website was created as part of my Bachelor's Thesis in Computer Science and focuses on the analysis of exoplanets. We invite you to explore it by navigating the available options above and to the side!",
  "exoplanetFinderDevelopers": "Developers",
  "exoplanet-info.title": "Exoplanets",
  "exoplanet-info.Subtitle": "Exploring Worlds Beyond Our Solar System",
  "exoplanet-info.section1": "Exoplanets, or extrasolar planets, are celestial bodies that orbit stars outside of our solar system. In other words, they are planets that do not belong to our cosmic neighborhood and are located in distant star systems.",
  "exoplanet-info.section2": "These exoplanets have become an area of great interest and research in astronomy. The search for exoplanets is conducted through advanced observation techniques and data analysis from space and ground-based telescopes.",
  "exoplanet-info.graph": "Light Curve",
  "exoplanet-info.section3": "One of the most common methods for detecting exoplanets is the transit method. In this method, scientists observe a temporary decrease in the brightness of a star when an exoplanet passes in front of it. This temporary decrease in brightness is called a transit.",
  "exoplanet-info.section4": "Another common method is radial velocity measurement, which detects exoplanets through the small 'wobble' they cause in the star they orbit due to gravitational force between them.",
  "exoplanet-info.section5": "The discovery and study of exoplanets is one of the most exciting areas of modern astronomy. It offers us the opportunity to expand our understanding of the cosmos and may help us answer fundamental questions about the existence of life beyond Earth.",
  "exoplanet-info.section6": "With continuously improved research technologies and methods, it is very likely that we will discover many more fascinating exoplanets in the future.",
  "AdaBoostClassifier": "AdaBoost Classifier",
  "XGBoostClassifier": "XGBoost Classifier",
  "SVMClassifier": "SVM Classifier",
  "adaboost.subtitle": "Improving Machine Learning Accuracy with AdaBoost",
  "adaboost.section1": "AdaBoost, a popular machine learning technique belonging to the Boosting category, combines multiple weak learning models to form a strong and accurate model. This algorithm trains predictors sequentially, with each one focused on correcting the mistakes of its predecessor. AdaBoost's uniqueness lies in its ability to boost a new predictor by giving greater importance to instances mispredicted by the previous predictor. This results in new predictors that are particularly skilled at correcting past errors. Virtually any machine learning algorithm can be used as the initial weak learning model, as long as it accepts weights associated with examples in the training set.",
  "adaboost.section2": "The AdaBoost algorithm starts by assigning equal weights to all samples. In each iteration, it builds a decision tree of depth 1 to classify the data. It calculates the weight of the selected tree based on the total error and updates the sample weights, giving higher importance to incorrect classifications. It then creates a new weighted dataset and repeats the process until it reaches the specified number of iterations. Finally, it uses the forest of decision trees to make predictions on unseen data. The trees are aggregated based on their decisions, and the final classification is determined by the sum of tree weights.",
  "xgboost.subtitle": "Elevating Machine Learning to New Heights",
  "xgboost.section1": "XGBoost, a machine learning algorithm based on decision tree and Gradient Boosting framework, gained prominence by becoming the most widely used prediction model in data science competitions like Kaggle. While neural networks are ideal for unstructured data such as images and text, for tabular data, decision tree algorithms like XGBoost are considered the most effective. Its rise was driven by its versatility, portability, and support for multiple programming languages.",
  "xgboost.section2": "Developed at the University of Washington by Tianqi Chen and Carlos Guestrin, XGBoost revolutionized data science competitions, being widely adopted both in the industry and in open-source projects, with an active community of contributors on GitHub. Its effectiveness lies in its ability to enhance the Gradient Boosting framework, resulting in superior performance with fewer computational resources. Despite its success, choosing the right algorithm depends on various factors, including computational cost, implementation timeline, and accuracy, and there are promising alternatives on the horizon of Machine Learning research.",
  "xgboost.section3": "While XGBoost continues to lead, Machine Learning research is constantly evolving, with frameworks like Microsoft Research's LightGBM and Yandex Technology's CatBoost showing promising potential. The competition to surpass XGBoost in terms of performance, flexibility, and explainability continues, but until a strong competitor emerges, XGBoost remains the king of Machine Learning algorithms.",
  "svm.subtitle": "Maximizing Separation in Machine Learning",
  "svm.section1": "Support Vector Machines (SVMs) are widely used supervised learning models for classification and regression. They excel in finding hyperplanes in the feature space that best separate the classes of data. This algorithm is effective for both linear classification and accommodating high-dimensional feature spaces, allowing efficient handling of nonlinear classifications.",
  "svm.section2": "The essence of how SVM works lies in searching for the optimal separation hyperplane. Various scenarios are considered for this purpose. For example, when choosing between different hyperplanes, it is essential to identify the one that provides the best separation between classes. The margin, which represents the distance between the hyperplane and the nearest data point, plays a crucial role in selecting the correct hyperplane, thus ensuring maximum effectiveness in classifying the classes.",
  "svm.section3": "In situations where multiple hyperplanes segregate the classes effectively, determining the appropriate plane becomes vital. In such cases, calculating the maximum margin, i.e., the greatest distance between the hyperplane and the data points, is fundamental. The hyperplane with the maximum margin is considered the most suitable for effective class separation.",
  "home.page.init": "Home",
  "home.page.exoplanets": "Exoplanets",
  "home.page.models": "Models",
  "home.page.telescopes": "Telescopes",
  "home.page.vision": "Vision",
  "telescope.tess.title": "Space Discoveries with the TESS Telescope",
  "telescope.tess.subtitle": "Exploring new worlds and distant stars",
  "telescope.tess.section1.h2": "1. The Exoplanet Hunter's Eye",
  "telescope.tess.section1.p": "The TESS Telescope is a true exoplanet hunter, designed to detect planets that transit in front of their host stars. It has already identified numerous exoplanets in its tireless search.",
  "telescope.tess.section2.h2": "2. A Comprehensive View of the Sky",
  "telescope.tess.section2.p": "One of TESS's highlights is its ability to observe wide areas of the sky in search of planets. It divides the sky into sectors and photographs each sector in detail, allowing for a comprehensive view of the cosmos.",
  "telescope.tess.section3.h2": "3. Variable Stars and Supernovae",
  "telescope.tess.section3.p": "TESS is not limited to searching for exoplanets alone. It also investigates variable stars and explosive events like supernovae, contributing to our understanding of how stars evolve and change over time.",
  "telescope.tess.section4.h2": "4. Beyond Our Solar System",
  "telescope.tess.section4.p": "With its discoveries of exoplanets, TESS offers us a glimpse of distant worlds, some of which may have conditions suitable for the existence of life. This expands our horizons in the search for extraterrestrial life.",
  "telescope.tess.section5.h2": "5. Technological Innovation",
  "telescope.tess.section5.p": "TESS uses cutting-edge technology, including high-resolution cameras, to capture detailed images of space. Its mission is a testament to the advancement of space technology.",
  "telescope.tess.p": "With the TESS Telescope, we are exploring the far reaches of the universe, unveiling cosmic secrets, and expanding our knowledge of the infinite space.",
  "telescope.k2.title": "Exploring the Universe with the K2 Telescope",
  "telescope.k2.subtitle": "Discover the secrets of the cosmos with this incredible space mission",
  "telescope.k2.section1.h2": "1. A Second Chance among the Stars",
  "telescope.k2.section1.p": "The K2 Telescope, originally part of the Kepler mission, found its rebirth after a gyroscope failure. Named K2, it pays tribute to Johannes Kepler, the renowned astronomer.",
  "telescope.k2.section2.h2": "2. Discovering Distant Worlds",
  "telescope.k2.section2.p": "K2 has been a true exoplanet hunter, with over 350 discoveries to date. From super-Earths to gas giants, it has gifted us with a myriad of worlds beyond our solar system.",
  "telescope.k2.section3.h2": "3. In Search of Habitability",
  "telescope.k2.section3.p": "One of K2's most exciting missions is the search for exoplanets in habitable zones where life could thrive. Its discoveries mark a milestone in the exploration of extraterrestrial life.",
  "telescope.k2.section4.h2": "4. Beyond the Known Limits",
  "telescope.k2.section4.p": "K2 didn't limit itself to just hunting exoplanets; it examined asteroids, variable stars, supernovae, and star clusters, providing a comprehensive view of the cosmos.",
  "telescope-kepler.title": "Unveiling the Cosmos with the Kepler Telescope",
  "telescope-kepler.subtitle": "Exploring the universe in search of distant planets",
  "telescope-kepler.section1.h2": "1. Exoplanet Hunt",
  "telescope-kepler.section1.p": "The Kepler Telescope is famous for its mission to hunt exoplanets. It has discovered thousands of planets orbiting other stars, revealing the vastness of planetary diversity in our galaxy.",
  "telescope-kepler.section2.h2": "2. Transit Method",
  "telescope-kepler.section2.p": "Kepler uses the transit method to detect exoplanets. It observes the periodic dimming of a star's brightness when a planet passes in front of it, allowing the identification of planets that are 'dancing' around their stars.",
  "telescope-kepler.section3.h2": "3. Habitable Worlds",
  "telescope-kepler.section3.p": "Among Kepler's discoveries, habitable zone exoplanets stand out, where conditions may be suitable for life to exist. These findings fuel our imagination about the possibility of life elsewhere in the universe.",
  "telescope-kepler.section4.h2": "4. Light Box",
  "telescope-kepler.section4.p": "Kepler is designed to keep its cameras at a constant temperature. It is protected by a 'light box' that maintains thermal stability and allows for high-precision observations.",
  "telescope-kepler.section5.h2": "5. Beyond Expectations",
  "telescope-kepler.section5.p": "Originally planned for a 3.5-year mission, Kepler exceeded all expectations and continued to operate beyond its projected lifetime. Its discoveries revolutionized our understanding of the universe.",
  "telescope-kepler.section5.p2": "Thanks to the Kepler Telescope, we are closer than ever to answering the question: 'Are there inhabited worlds out there?'",
  "Models": "Models",
  "graphs": "Graphs",
  "table": "Table",
  "table.telescope": "Telescope",
  "search": "Search",
  "DownloadData": "Download Data",
  "vision-about": "About",
  "vision-about-title": "Vision",
  "vision-about-subtitle": "Representations in Machine Learning",
  "vision-about-sector1.p": "In machine learning, the term 'vision' refers to a machine learning model's ability to 'see' and interpret patterns in input data. This is especially relevant in computer vision tasks, where the goal is to extract meaningful information from images or videos. There are global and local views of data, which will be discussed in the following sections.",
  "vision-about-sector2.p": "Often, the strategic combination of these approaches is employed in computer vision applications to maximize accurate interpretation of complex visual data. This synergy between global and local vision plays a crucial role in the ability of machine learning models to understand and interact with visual information across a wide range of contexts.",
  "global-subtitle": "Overview of Data",
  "global-section1.p": "Global vision in machine learning focuses on identifying comprehensive patterns and features in an image or dataset. This approach seeks to extract high-level information such as contours, shapes, and predominant textures, enabling a general understanding of the scene.",
  "global-section2.p": "By focusing on broader features, models using global vision tend to be less sensitive to specific details or subtle variations in the data. This makes them particularly useful in tasks that require a more comprehensive perception of the environment, such as object recognition in complex images.",
  "global-section3.p": "Our global vision analysis of light curves has a total of 2001 points, which is larger than the local vision to provide a more comprehensive analysis of planetary transits.",
  "local-subtitle": "Specific Data View",
  "local-section1.p": "Local vision in machine learning focuses on specific details and low-level features in an image. This approach seeks to identify fine elements such as sharp edges, small textures, or distinct pixel patterns.",
  "local-section2.p": "By analyzing specific parts of the image in detail, models using local vision are highly sensitive to minute variations in the data. This makes them especially effective in tasks that require a detailed understanding of image structure, such as specific feature detection or object segmentation in a scene. For local vision, we will use a fixed size of 201 points for light curves.",
  "vision-modal-input-file": "Vision",
  "modal-show-info-model": "Evaluation Metrics:",
  "modal-show-info-model-matrix": "CONFUSION MATRIX",
  "modal-show-info-model-metrics": "METRICS",
  "select-model-search": "Search",
  "select-model-models": "Model",
  "select-model-vision": "Vision",
  "select-model-telescope": "Telescope",
  "select-model-targets": "Targets",
  "select-model-info": "Metrics",
  "select-model-clean": "Clear",
  "select-model-submit": "Execute",
  "select-mode-table-model": "Model",
  "select-mode-table-vision": "Vision",
  "select-mode-table-telescope": "Telescope",
  "select-mode-table-prob": "Probability",
  "select-mode-table-graph": "Graph",
  "modal-about-models-title": "Information",
  "modal-about-models-subtitle": "About the Page",
  "modal-about-models-section-p1": "This page is used to make predictions about the selected candidates in the field",
  "modal-about-models-section-p2": "It is also possible to insert pretrained models, selecting the correct vision when inserting, to avoid platform malfunction",
  "modal-about-models-section-p3": "Each prediction will have its probability of being an exoplanet with a graph to show the candidate's light curve.",
  "modal-about-graph-title": "Information",
  "modal-about-graph-subtitle": "About the Page",
  "modal-about-graph-section-p1": "This page contains graphical analysis of exoplanet candidates.",
  "modal-about-graph-section-p2": "You can select any observation, and various graphs will be generated for it.",
  "graph-page-obs": "Observations",
  "graph-page-select-telescope": "Select the telescope",
  "graph-page-select-candidates?": "Do you want to select candidates?",
  "clean": "Clear",
  "about-graph": "About the Graphs Page",
  "about-candidates": "Observations were made in locations where there is a possibility of the existence of an exoplanet or not.",
  "about-page": "About the Page",
  "insert": "Insert",
  "modal-about-tables-text1": "This page presents a sample of the database for each telescope, containing 400 rows, where each column and its respective value are represented.",
  "modal-about-tables-text2": "If you wish to access the complete database, you can simply click on the Download button, which provides all thousands of rows.",
  "title-select-sector": "Select the desired sector:",
  "observationsCount": "Number of observations",
  "sector": "Sector",
  "observationMission": "Observation Mission Name",
  "authors": "Authors",
  "global": "Global",
  "local": "Local",
  "abaut": "About",
  "closeDialog": "Close",
  "Targets": "Targets",
  "InsertModel": "Insert Model",
  "info": "About the templates page",
  "about-pagee": "About the table page"
}
