{
  "home.languages": "Idiomas",
  "translate.portuguese": "Portugués",
  "translate.english": "Inglés",
  "translate.spanish": "Español",
  "translate.french": "Francés",
  "translate.german": "Alemán",
  "translate.china": "Chino",
  "homePage": "Página de Inicio",
  "home.title": "Exoplanetas",
  "text": "Proyecto de Tesis de Grado",
  "Home.message": "Bienvenido a Exoplanet-Finder",
  "join.form.name": "Nombre",
  "join.form.familyName": "Apellido",
  "join.form.email": "Correo Electrónico",
  "join.form.password": "Contraseña",
  "join.form.login": "Registrarse",
  "join.form.name.errorMessage": "El nombre es obligatorio",
  "join.form.familyName.errorMessage": "El apellido es obligatorio",
  "join.form.email.errorMessage": "El correo electrónico es obligatorio y debe ser válido",
  "join.form.password.errorMessage": "La contraseña es obligatoria y debe tener al menos 10 caracteres, incluyendo al menos una letra mayúscula y un carácter especial.",
  "TelescópioKepler": "Telescopio Kepler",
  "TelescópioTESS": "Telescopio TESS",
  "TelescópioK2": "Telescopio K2",
  "addArchive": "Añadir un archivo para ver el gráfico",
  "notFoundTitle": "404 - Página no encontrada",
  "notFoundMessage": "Lo siento, la página que estás buscando no existe.",
  "serverErrorTitle": "500 - Error interno del servidor",
  "serverErrorMessage": "Lo siento, se produjo un error interno en el servidor que impidió completar tu solicitud.",
  "tessCuriosity": "Curiosidades sobre el Telescopio TESS",
  "tessSubtitle": "El Telescopio Espacial de Estudio de Exoplanetas, conocido como TESS, es una de las misiones espaciales más emocionantes e innovadoras de la NASA. Fue lanzado el 18 de abril de 2018 y su objetivo principal es descubrir exoplanetas. Pero además de esta misión fundamental, TESS tiene varias curiosidades fascinantes que lo convierten en una pieza valiosa en la exploración espacial:",
  "topic1": "1. Observatorio de Caza de Exoplanetas:",
  "tessText1": "TESS a menudo se llama 'cazador de exoplanetas' debido a su capacidad para detectar planetas en tránsito, es decir, cuando pasan frente a sus estrellas anfitrionas, bloqueando parcialmente su luz. Esta es una técnica crucial para encontrar exoplanetas.",
  "topic2": "2. Diversidad Estelar:",
  "tessText2": "TESS ha observado una amplia gama de estrellas en su búsqueda de exoplanetas, incluyendo gigantes rojas, enanas blancas, estrellas jóvenes e incluso sistemas estelares binarios, donde dos estrellas orbitan una alrededor de la otra.",
  "topic3": "3. Descubriendo Habitables:",
  "tessText3": "TESS ha descubierto varios exoplanetas que orbitan en la 'zona habitable' de sus estrellas madre, donde las condiciones podrían ser adecuadas para la presencia de agua líquida y posiblemente vida tal como la conocemos.",
  "topic4": "4. Variedad de Tamaños:",
  "tessText4": "Los descubrimientos de TESS han mostrado que los exoplanetas vienen en una amplia variedad de tamaños, desde gigantes gaseosos similares a Júpiter hasta planetas rocosos más pequeños similares a la Tierra.",
  "topic5": "5. Exoplanetas Rápidos:",
  "tessText5": "TESS también ha detectado exoplanetas en órbitas extremadamente rápidas, completando vueltas alrededor de sus estrellas en cuestión de horas. Esto desafía nuestra comprensión convencional de la formación planetaria.",
  "tessText6": "El Telescopio Kepler, con su búsqueda pionera de exoplanetas y sus fascinantes descubrimientos cósmicos, seguirá siendo un hito en la historia de la exploración espacial, abriendo nuevos horizontes para nuestra comprensión del vasto y diverso universo que nos rodea.",
  "scatterPLotTitle": "Gráfico de Dispersión",
  "exoplanetFinderTitle": "Bienvenido(a) a",
  "exoplanetFinderSubtitle": "Explorando el Vasto Universo",
  "exoplanetFinderDescription": "Este sitio web fue creado como parte de mi Trabajo de Fin de Carrera en Ciencias de la Computación y se centra en el análisis de exoplanetas. Le invitamos a explorarlo navegando por las opciones disponibles arriba y a un lado.",
  "exoplanetFinderDevelopers": "Desarrolladores",
  "exoplanet-info.title": "Exoplanetas",
  "exoplanet-info.Subtitle": "Explorando Mundos más Allá de Nuestro Sistema Solar",
  "exoplanet-info.section1": "Los exoplanetas, o planetas extrasolares, son cuerpos celestes que orbitan estrellas fuera de nuestro sistema solar. En otras palabras, son planetas que no pertenecen a nuestra vecindad cósmica y se encuentran en sistemas estelares distantes.",
  "exoplanet-info.section2": "Estos exoplanetas se han convertido en un área de gran interés e investigación en la astronomía. La búsqueda de exoplanetas se realiza a través de técnicas avanzadas de observación y análisis de datos de telescopios espaciales y terrestres.",
  "exoplanet-info.graph": "Curva de Luz",
  "exoplanet-info.section3": "Uno de los métodos más comunes para detectar exoplanetas es el método de tránsito. En este método, los científicos observan una pequeña reducción temporal en el brillo de una estrella cuando un exoplaneta pasa frente a ella. Esta disminución temporal en el brillo se llama tránsito.",
  "exoplanet-info.section4": "Otro método común es la medición de velocidad radial, que detecta exoplanetas a través del pequeño 'balanceo' que causan en la estrella que orbitan debido a la fuerza gravitacional entre ellos.",
  "exoplanet-info.section5": "El descubrimiento y estudio de exoplanetas es una de las áreas más emocionantes de la astronomía moderna. Nos ofrece la oportunidad de ampliar nuestra comprensión del cosmos y puede ayudarnos a responder preguntas fundamentales sobre la existencia de vida más allá de la Tierra.",
  "exoplanet-info.section6": "Con tecnologías y métodos de investigación en constante mejora, es muy probable que descubramos muchos más exoplanetas fascinantes en el futuro.",
  "AdaBoostClassifier": "Clasificador AdaBoost",
  "XGBoostClassifier": "Clasificador XGBoost",
  "SVMClassifier": "Clasificador SVM",
  "adaboost.subtitle": "Mejorando la Precisión del Aprendizaje Automático con AdaBoost",
  "adaboost.section1": "AdaBoost, una técnica popular de aprendizaje automático perteneciente a la categoría de Boosting, combina varios modelos de aprendizaje débiles para formar un modelo fuerte y preciso. Este algoritmo entrena a los predictores secuencialmente, cada uno enfocado en corregir las deficiencias de su predecesor. Lo distintivo de AdaBoost radica en su capacidad para mejorar un nuevo predictor, otorgando mayor importancia a las instancias mal predichas por el predictor anterior. Esto resulta en nuevos predictores especialmente hábiles para corregir los errores pasados. Prácticamente cualquier algoritmo de aprendizaje automático puede utilizarse como el modelo de aprendizaje débil inicial, siempre que acepte pesos asociados a los ejemplos en el conjunto de entrenamiento.",
  "adaboost.section2": "El algoritmo AdaBoost comienza asignando pesos iguales a todas las muestras. En cada iteración, construye un árbol de decisión de profundidad 1 para clasificar los datos. Calcula el peso del árbol seleccionado en función del error total y actualiza los pesos de las muestras, otorgando mayor importancia a las clasificaciones incorrectas. Luego, crea un nuevo conjunto de datos ponderados y repite el proceso hasta alcanzar el número de iteraciones especificado. Finalmente, utiliza el conjunto de árboles de decisión para hacer predicciones en datos no vistos. Los árboles se agrupan en función de sus decisiones y la clasificación final se determina por la suma de los pesos de los árboles.",
  "xgboost.subtitle": "Elevando el Aprendizaje Automático a un Nuevo Nivel",
  "xgboost.section1": "XGBoost, un algoritmo de aprendizaje automático basado en árboles de decisión y estructura de Gradient Boosting, ha ganado notoriedad al convertirse en el modelo de predicción más ampliamente utilizado en competiciones de ciencia de datos como Kaggle. Mientras que las redes neuronales son ideales para datos no estructurados como imágenes y texto, para datos tabulares, los algoritmos de árboles de decisión como XGBoost se consideran los más efectivos. Su ascenso ha sido impulsado por su versatilidad, portabilidad y soporte en varios lenguajes de programación.",
  "xgboost.section2": "Desarrollado en la Universidad de Washington por Tianqi Chen y Carlos Guestrin, XGBoost revolucionó las competiciones de ciencia de datos y es ampliamente adoptado tanto en la industria como en proyectos de código abierto, con una comunidad activa de colaboradores en GitHub. Su eficacia radica en la capacidad de mejorar la estructura de Gradient Boosting, lo que resulta en un rendimiento superior con menos recursos computacionales. A pesar de su éxito, la elección del algoritmo adecuado depende de diversos factores, incluyendo el costo computacional, el plazo de implementación y la precisión, y existen alternativas prometedoras en la investigación de Aprendizaje Automático.",
  "xgboost.section3": "Aunque XGBoost continúa liderando, la investigación en Aprendizaje Automático está en constante evolución, con frameworks como LightGBM de Microsoft Research y CatBoost de Yandex Technology mostrando un potencial prometedor. La competencia para superar a XGBoost en términos de rendimiento, flexibilidad y explicabilidad continúa, pero hasta que surja un competidor sólido, XGBoost sigue siendo el rey de los algoritmos de Aprendizaje Automático.",
  "svm.subtitle": "Maximizando la Separación en Aprendizaje Automático",
  "svm.section1": "Las Máquinas de Soporte Vectorial (SVMs) son modelos de aprendizaje supervisado ampliamente utilizados para clasificación y regresión. Se destacan al encontrar hiperplanos en el espacio de características que separan mejor las clases de los datos. Este algoritmo es efectivo tanto para clasificación lineal como para manejar espacios de características de alta dimensión, lo que permite abordar clasificaciones no lineales de manera eficiente.",
  "svm.section2": "La esencia del funcionamiento de una SVM radica en la búsqueda del hiperplano de separación óptimo. Para este propósito, se consideran varios escenarios. Por ejemplo, al elegir entre diferentes hiperplanos, es esencial identificar aquel que ofrece la mejor separación entre las clases. El margen, que representa la distancia entre el hiperplano y el punto de datos más cercano, desempeña un papel crucial en la selección del hiperplano correcto, asegurando así la máxima eficacia en la clasificación de las clases.",
  "svm.section3": "En situaciones en las que varios hiperplanos segregan bien las clases, la determinación del plano adecuado se vuelve vital. En estos casos, el cálculo del margen máximo, es decir, la mayor distancia entre el hiperplano y los puntos de datos, es fundamental. El hiperplano con el margen máximo se considera el más apropiado para la clasificación efectiva de las clases, garantizando una separación óptima.",
  "home.page.init": "Inicio",
  "home.page.exoplanets": "Exoplanetas",
  "home.page.models": "Modelos",
  "home.page.telescopes": "Telescopios",
  "home.page.vision": "Visión",
  "telescope.tess.title": "Descubrimientos Espaciales con el Telescopio TESS",
  "telescope.tess.subtitle": "Explorando nuevos mundos y estrellas distantes",
  "telescope.tess.section1.h2": "1. El Ojo Cazador de Exoplanetas",
  "telescope.tess.section1.p": "El Telescopio TESS es un verdadero cazador de exoplanetas, diseñado para detectar planetas que transitan frente a sus estrellas anfitrionas. Ya ha identificado innumerables exoplanetas en su incansable búsqueda.",
  "telescope.tess.section2.h2": "2. Una Visión Integral del Cielo",
  "telescope.tess.section2.p": "Uno de los aspectos más destacados del TESS es su capacidad para observar amplias áreas del cielo en busca de planetas. Divide el cielo en sectores y fotografía cada sector en detalle, permitiendo una visión integral del cosmos.",
  "telescope.tess.section3.h2": "3. Estrellas Variables y Supernovas",
  "telescope.tess.section3.p": "El TESS no se limita a buscar exoplanetas. También investiga estrellas variables y eventos explosivos como supernovas, contribuyendo a nuestra comprensión de cómo las estrellas evolucionan y cambian con el tiempo.",
  "telescope.tess.section4.h2": "4. Visión más allá de Nuestro Sistema Solar",
  "telescope.tess.section4.p": "Con sus descubrimientos de exoplanetas, el TESS nos ofrece una visión de mundos distantes, algunos de los cuales podrían tener condiciones propicias para la existencia de vida. Esto amplía nuestros horizontes en la búsqueda de vida extraterrestre.",
  "telescope.tess.section5.h2": "5. Innovación Tecnológica",
  "telescope.tess.section5.p": "El TESS utiliza tecnología de vanguardia, incluyendo cámaras de alta resolución, para capturar imágenes detalladas del espacio. Su misión es un testimonio del avance de la tecnología espacial.",
  "telescope.tess.p": "Con el Telescopio TESS, estamos explorando los confines del universo, revelando secretos cósmicos y expandiendo nuestro conocimiento del espacio infinito.",
  "telescope.k2.title": "Explorando el Universo con el Telescopio K2",
  "telescope.k2.subtitle": "Descubre los secretos del cosmos con esta increíble misión espacial",
  "telescope.k2.section1.h2": "1. Una Segunda Oportunidad en las Estrellas",
  "telescope.k2.section1.p": "El Telescopio K2, originalmente parte de la misión Kepler, encontró su renacimiento después de una falla en los giroscopios. Con el nombre de K2, rinde homenaje a Johannes Kepler, el célebre astrónomo.",
  "telescope.k2.section2.h2": "2. Descubriendo Mundos Distantes",
  "telescope.k2.section2.p": "El K2 ha sido un verdadero cazador de exoplanetas, con más de 350 descubrimientos hasta el momento. Desde super-Tierras hasta gigantes gaseosos, nos ha regalado una miríada de mundos más allá de nuestro sistema solar.",
  "telescope.k2.section3.h2": "3. En Busca de Habitabilidad",
  "telescope.k2.section3.p": "Una de las misiones más emocionantes del K2 es la búsqueda de exoplanetas en zonas habitables, donde la vida podría prosperar. Sus descubrimientos son un hito en la exploración de la vida extraterrestre.",
  "telescope.k2.section4.h2": "4. Más Allá de los Límites Conocidos",
  "telescope.k2.section4.p": "El K2 no se limitó solo a la caza de exoplanetas; examinó asteroides, estrellas variables, supernovas y cúmulos estelares, ofreciendo una visión completa del cosmos.",
  "telescope-kepler.title": "Descifrando el Cosmos con el Telescopio Kepler",
  "telescope-kepler.subtitle": "Explorando el universo en busca de planetas distantes",
  "telescope-kepler.section1.h2": "1. Cazando Exoplanetas",
  "telescope-kepler.section1.p": "El Telescopio Kepler es famoso por su misión de caza de exoplanetas. Descubrió miles de planetas que orbitan otras estrellas, revelando la vastedad de la diversidad planetaria en nuestra galaxia.",
  "telescope-kepler.section2.h2": "2. El Método de Tránsito",
  "telescope-kepler.section2.p": "El Kepler utiliza el método de tránsito para detectar exoplanetas. Observa la disminución periódica del brillo de una estrella cuando un planeta pasa frente a ella, lo que permite la identificación de planetas que están 'bailando' alrededor de sus estrellas.",
  "telescope-kepler.section3.h2": "3. Mundos Habitables",
  "telescope-kepler.section3.p": "Entre los descubrimientos del Kepler, destacan exoplanetas en zonas habitables, donde las condiciones podrían ser adecuadas para la existencia de vida. Estos descubrimientos alimentan nuestra imaginación sobre la posibilidad de vida en otros lugares del universo.",
  "telescope-kepler.section4.h2": "4. La Caja de Luz",
  "telescope-kepler.section4.p": "El Kepler fue diseñado para mantener sus cámaras a una temperatura constante. Está protegido por una 'caja de luz' que mantiene la estabilidad térmica y permite observaciones de alta precisión.",
  "telescope-kepler.section5.h2": "5. Misión Más Allá de las Expectativas",
  "telescope-kepler.section5.p": "Originalmente planeado para una misión de 3,5 años, el Kepler superó todas las expectativas y continuó operando más allá de su tiempo de vida proyectado. Sus descubrimientos revolucionaron nuestra comprensión del universo.",
  "telescope-kepler.section5.p2": "Gracias al Telescopio Kepler, estamos más cerca que nunca de responder a la pregunta: '¿Existen otros mundos habitados por ahí?'",
  "Models": "Modelos",
  "graphs": "Gráficos",
  "table": "Tabla",
  "table.telescope": "Telescopio",
  "search": "Buscar",
  "DownloadData": "Descargar Datos",
  "vision-about": "Acerca de",
  "vision-about-title": "Visión",
  "vision-about-subtitle": "Representaciones en el aprendizaje automático",
  "vision-about-sector1.p": "En el aprendizaje automático, el término 'visión' se refiere a la capacidad de un modelo de aprendizaje automático para 'ver' e interpretar patrones en los datos de entrada. Esto es especialmente relevante en tareas de visión por computadora, donde el objetivo es extraer información significativa de imágenes o videos. Hay visiones globales y locales de los datos, que se abordarán en las próximas secciones.",
  "vision-about-sector2.p": "A menudo, la combinación estratégica de estas aproximaciones se emplea en aplicaciones de visión por computadora para maximizar la interpretación precisa de datos visuales complejos. Esta sinergia entre la visión global y local desempeña un papel crucial en la capacidad de los modelos de aprendizaje automático para comprender e interactuar con información visual en una amplia gama de contextos.",
  "global-subtitle": "Visión Global de los Datos",
  "global-section1.p": "La visión global en el aprendizaje automático se centra en la identificación de patrones y características generales en una imagen o conjunto de datos. Este enfoque busca extraer información de alto nivel, como contornos, formas y texturas predominantes, lo que permite una comprensión general de la escena.",
  "global-section2.p": "Al centrarse en características más amplias, los modelos que utilizan la visión global tienden a ser menos sensibles a detalles específicos o variaciones sutiles en los datos. Esto los hace particularmente útiles en tareas que requieren una percepción más completa del entorno, como el reconocimiento de objetos en imágenes complejas.",
  "global-section3.p": "Nuestros análisis de la visión global de las curvas de luz constan de un total de 2001 puntos, que es mayor que la visión local para proporcionar un análisis más completo del tránsito planetario.",
  "local-subtitle": "Visión Específica de los Datos",
  "local-section1.p": "La visión local en machine learning se concentra en detalles específicos y características de bajo nivel en una imagen. Esta aproximación busca identificar elementos finos, como bordes nítidos, texturas pequeñas o patrones de píxeles distintivos.",
  "local-section2.p": "Al analizar partes específicas de la imagen en detalle, los modelos que utilizan la visión local son altamente sensibles a variaciones minuciosas en los datos. Esto los hace especialmente eficaces en tareas que requieren una comprensión detallada de la estructura de la imagen, como la detección de características específicas o la segmentación de objetos en una escena. Para la visión local, utilizaremos un tamaño fijo de 201 puntos para las curvas de luz.",
  "vision-modal-input-file": "Visión",
  "modal-show-info-model": "Métricas de Evaluación:",
  "modal-show-info-model-matriz": "MATRIZ DE CONFUSIÓN",
  "modal-show-info-model-metricas": "MÉTRICAS",
  "select-model-search": "Buscar",
  "select-model-models": "Modelo",
  "select-model-vision": "Visión",
  "select-model-telescope": "Telescopio",
  "select-model-targets": "Objetivos",
  "select-model-info": "Métricas",
  "select-model-clean": "Limpiar",
  "select-model-submit": "Ejecutar",
  "select-mode-table-model": "Modelo",
  "select-mode-table-vision": "Visión",
  "select-mode-table-telescope": "Telescopio",
  "select-mode-table-prob": "Probabilidad",
  "select-mode-table-graph": "Gráfico",
  "modal-about-models-title": "Información",
  "modal-about-models-subtitle": "Acerca de la página",
  "modal-about-models-section-p1": "Esta página se utiliza para hacer predicciones de los candidatos seleccionados en el campo ",
  "modal-about-models-section-p2": "También es posible cargar modelos preentrenados seleccionando la visión correcta al cargarlos para evitar problemas en la plataforma",
  "modal-about-models-section-p3": "Cada predicción mostrará la probabilidad de que sea un exoplaneta junto con un gráfico que muestra la curva de luz del candidato.",
  "modal-about-graph-title": "Información",
  "modal-about-graph-subtitle": "Acerca de la página",
  "modal-about-graph-section-p1": "Esta página contiene análisis gráficos de los candidatos a exoplanetas.",
  "modal-about-graph-section-p2": "Puede seleccionar una observación en particular y se generarán varios gráficos relacionados con ella.",
  "graph-page-obs": "Observaciones",
  "graph-page-select-telescope": "Seleccione el telescopio",
  "graph-page-select-candidates?": "¿Desea seleccionar candidatos?",
  "clean": "Limpiar",
  "about-graph": "Acerca de la página de gráficos",
  "about-candidates": "Se realizaron observaciones en lugares donde existe la posibilidad de la existencia de un exoplaneta o no.",
  "about-page": "Acerca de la página",
  "insert": "Insertar",
  "modal-about-tables-text1": "Esta página presenta una muestra de la base de datos de cada telescopio, con 400 filas, donde cada columna y su valor correspondiente están representados.",
  "modal-about-tables-text2": "Si desea acceder a la base completa, simplemente puede hacer clic en el botón de Descarga, que proporciona todas las miles de filas.",
  "title-select-sector": "Seleccione el sector deseado:",
  "observationsCount": "Número de observaciones",
  "sector": "Sector",
  "observationMission": "Nombre de la misión que realizó la observación",
  "authors": "Autores",
  "global": "Global",
  "local": "Local",
  "about": "Acerca de",
  "closeDialog": "Cerrar",
  "Targets": "Objetivos",
  "InsertModel": "Insertar modelo",
  "info": "Sobre la página de modelos",
  "about-pagee": "Acerca de la página de tabla"
}