{
  "home.languages": "Idiomas",
  "translate.portuguese": "Português",
  "translate.english": "Inglês",
  "translate.spanish": "Espanhol",
  "translate.french": "Francês",
  "translate.german": "Alemão",
  "translate.china": "Chinês",
  "homePage": "Página Inicial",
  "home.title": "Exoplanetas",
  "text": "Projeto de TCC",
  "Home.message": "Bem vindo ao Exoplanet-Finder",
  "join.form.name": "Nome",
  "join.form.familyName": "Sobrenome",
  "join.form.email": "E-mail",
  "join.form.password": "Senha",
  "join.form.login": "Cadastrar",
  "join.form.name.errorMessage": "O nome é obrigatório",
  "join.form.familyName.errorMessage": "O sobrenome é obrigatório",
  "join.form.email.errorMessage": "O email é obrigatório e deve ser válido",
  "join.form.password.errorMessage": "A senha é obrigatória e deve ter pelo menos 10 caracteres, incluindo pelo menos uma letra maiúscula e um caracter especial.",
  "TelescópioKepler": "Telescópio Kepler",
  "TelescópioTESS": "Telescópio TESS",
  "TelescópioK2": "Telescópio K2",
  "addArchive": "Adicione um arquivo para visualizar o gráfico",
  "notFoundTitle": "404 - Página não encontrada",
  "notFoundMessage": "Desculpe, a página que você está procurando não existe.",
  "serverErrorTitle": "500 - Erro interno do servidor",
  "serverErrorMessage": "Desculpe, ocorreu um erro interno no servidor que impediu a conclusão da sua solicitação.",
  "tessCuriosity": "Curiosidades sobre o Telescópio TESS",
  "tessSubtitle": "O Telescópio Espacial de Estudo de Exoplanetas, conhecido como TESS, é uma das missões espaciais mais emocionantes e inovadoras da NASA. Lançado em 18 de abril de 2018, o TESS tem como objetivo principal descobrir exoplanetas. Mas, além dessa missão fundamental, o TESS tem várias curiosidades fascinantes que o tornam uma peça valiosa na exploração espacial:",
  "topic1": "1. Observatório de Caça a Exoplanetas:",
  "tessText1": "O TESS é muitas vezes chamado de 'caçador de exoplanetas' por sua capacidade de detectar planetas em trânsito, ou seja, quando eles passam na frente de suas estrelas hospedeiras, bloqueando parcialmente a luz delas. Isso é uma técnica crucial para encontrar exoplanetas.",
  "topic2": "2. Diversidade Estelar:",
  "tessText2": "O Kepler observou uma ampla gama de estrelas em sua busca por exoplanetas, incluindo gigantes vermelhas, anãs brancas, estrelas jovens e até mesmo sistemas estelares binários, onde duas estrelas orbitam uma em torno da outra.",
  "topic3": "3. Descobrindo Habitáveis:",
  "tessText3": "O Kepler descobriu uma série de exoplanetas que orbitavam na 'zona habitável' de suas estrelas-mãe, onde as condições poderiam ser adequadas para a presença de água líquida e, possivelmente, vida como a conhecemos.",
  "topic4": "4. Variedade de Tamanhos:",
  "tessText4": "As descobertas do Kepler mostraram que os exoplanetas vêm em uma ampla variedade de tamanhos, desde gigantes gasosos semelhantes a Júpiter até planetas rochosos menores, semelhantes à Terra.",
  "topic5": "5. Exoplanetas Perversos:",
  "tessText5": "O Kepler também detectou exoplanetas em órbitas extremamente rápidas, completando voltas ao redor de suas estrelas em questão de poucas horas. Isso desafiou nossa compreensão convencional da formação planetária.",
  "tessText6": "O Telescópio Kepler, com sua busca pioneira por exoplanetas e suas fascinantes descobertas cósmicas, permanecerá como um marco na história da exploração espacial, abrindo novos horizontes para nossa compreensão do universo vasto e diversificado que nos rodeia.",
  "scatterPLotTitle": "Gráfico de dispersão",
  "exoplanetFinderTitle": "Bem vindo(a) ao",
  "exoplanetFinderSubtitle": "Explorando o vasto Universo",
  "exoplanetFinderDescription": "Este website foi criado como parte do meu Trabalho de Conclusão de Curso em Ciência da Computação e tem como foco a análise de exoplanetas. Este website foi criado como parte do Trabalho de Conclusão de Curso em Ciência da Computação e tem como foco a análise de exoplanetas. Convidamos você a explorá-lo, navegando pelas opções disponíveis acima e ao lado!",
  "exoplanetFinderDevelopers": "Desenvolvedores",
  "exoplanet-info.title": "Exoplanetas",
  "exoplanet-info.Subtitle": "Explorando mundos além do nosso sistema solar",
  "exoplanet-info.section1": "Exoplanetas, ou planetas extrassolares, são corpos celestes que orbitam estrelas fora do nosso sistema solar. Em outras palavras, são planetas que não pertencem à nossa vizinhança cósmica e estão localizados em sistemas estelares distantes.",
  "exoplanet-info.section2": "Esses exoplanetas têm se tornado uma área de grande interesse e pesquisa na astronomia. A busca por exoplanetas é conduzida através de técnicas avançadas de observação e análise de dados provenientes de telescópios espaciais e terrestres.",
  "exoplanet-info.graph": "Curva de Luz",
  "exoplanet-info.section3": "Um dos métodos mais comuns de detecção de exoplanetas é o método de trânsito. Neste método, os cientistas observam uma pequena redução temporária no brilho de uma estrela quando um exoplaneta passa em frente a ela. Esta diminuição temporária no brilho é chamada de trânsito.",
  "exoplanet-info.section4": "Outro método comum é a medição de velocidade radial, que detecta exoplanetas através do pequeno 'balanço' que eles causam na estrela que orbitam, devido à força gravitacional entre eles.",
  "exoplanet-info.section5": "A descoberta e estudo de exoplanetas é uma das áreas mais emocionantes da astronomia moderna. Ela nos oferece a oportunidade de expandir nossa compreensão do cosmos e pode nos ajudar a responder a perguntas fundamentais sobre a existência de vida além da Terra.",
  "exoplanet-info.section6": "Com tecnologias e métodos de pesquisa continuamente aprimorados, é muito provável que descobriremos muitos mais exoplanetas fascinantes no futuro.",
  "AdaBoostClassifier": "Classificador AdaBoost",
  "XGBoostClassifier": "Classificador XGBoost",
  "SVMClassifier": "Classificador SVM",
  "adaboost.subtitle": "Melhorando a precisão do aprendizado de máquina com o AdaBoost",
  "adaboost.section1": "O AdaBoost, uma técnica popular de aprendizado de máquina pertencente à categoria de Boosting, combina vários modelos de aprendizado fracos para formar um modelo forte e preciso. Este algoritmo treina os preditores sequencialmente, cada um focado em corrigir as falhas do seu antecessor. O diferencial do AdaBoost está na sua capacidade de aprimorar um novo preditor, dando maior importância às instâncias mal previstas pelo preditor anterior. Isso resulta em novos preditores especialmente habilidosos em corrigir os erros passados. Praticamente qualquer algoritmo de aprendizado de máquina pode ser usado como o modelo de aprendizado fraco inicial, desde que aceite pesos associados aos exemplos no conjunto de treinamento.",
  "adaboost.section2": "O algoritmo AdaBoost inicia atribuindo pesos iguais a todas as amostras. Em cada iteração, constrói uma árvore de decisão de profundidade 1 para classificar os dados. Calcula o peso da árvore selecionada com base no erro total e atualiza os pesos das amostras, dando maior importância às classificações incorretas. Em seguida, cria um novo conjunto de dados ponderado e repete o processo até atingir o número de iterações especificado. Por fim, utiliza a floresta de árvores de decisão para fazer previsões em dados não vistos. As árvores são agrupadas com base em suas decisões e a classificação final é determinada pela soma dos pesos das árvores.",
  "xgboost.subtitle": "Elevando o aprendizado de máquina a um novo patamar",
  "xgboost.section1": "O XGBoost, um algoritmo de aprendizado de máquina baseado em árvore de decisão e estrutura de Gradient Boosting, ganhou destaque ao se tornar o modelo de predição mais amplamente utilizado em competições de ciência de dados, como o Kaggle. Enquanto redes neurais são ideais para dados não estruturados, como imagens e textos, para dados tabulares, os algoritmos de árvore de decisão, como o XGBoost, são considerados os mais eficazes. Sua ascensão foi impulsionada pela sua versatilidade, portabilidade e suporte a diversas linguagens de programação.",
  "xgboost.section2": "Desenvolvido na Universidade de Washington por Tianqi Chen e Carlos Guestrin, o XGBoost revolucionou as competições de ciência de dados, sendo amplamente adotado tanto na indústria quanto em projetos de código aberto, com uma comunidade ativa de colaboradores no GitHub. Sua eficácia está na capacidade de aprimorar a estrutura do Gradient Boosting, resultando em um desempenho superior com menos recursos computacionais. Apesar de seu sucesso, a escolha do algoritmo certo depende de diversos fatores, incluindo custo computacional, prazo de implementação e acurácia, e há alternativas promissoras no horizonte da pesquisa em Machine Learning.",
  "xgboost.section3": "Embora o XGBoost continue a liderar, a pesquisa em Machine Learning está em constante evolução, com frameworks como LightGBM da Microsoft Research e o CatBoost da Yandex Technology mostrando potencial promissor. A competição para superar o XGBoost em termos de desempenho, flexibilidade e explicabilidade continua, mas até que um concorrente forte surja, o XGBoost continua a reinar como o rei dos algoritmos de Machine Learning.",
  "svm.subtitle": "Maximizando a separação em aprendizado de máquina",
  "svm.section1": "Support Vector Machines (SVMs) são modelos de aprendizado supervisionado amplamente utilizados para classificação e regressão. Eles se destacam ao encontrar hiperplanos no espaço de características que melhor separam as classes dos dados. Este algoritmo é eficaz tanto para classificação linear quanto para acomodar espaços de características de alta dimensão, permitindo lidar com classificações não lineares de forma eficiente.",
  "svm.section2": "A essência do funcionamento de um SVM reside na busca pelo hiperplano de separação ótimo. Para este fim, são considerados diversos cenários. Por exemplo, ao escolher entre diferentes hiperplanos, é essencial identificar aquele que oferece a melhor separação entre as classes. A margem, que representa a distância entre o hiperplano e o ponto de dados mais próximo, desempenha um papel crucial na seleção do hiperplano correto, assegurando assim a máxima eficácia na classificação das classes.",
  "svm.section3": "Em situações em que vários hiperplanos segregam bem as classes, a determinação do plano adequado torna-se vital. Nesses casos, o cálculo da margem máxima, ou seja, a maior distância entre o hiperplano e os pontos de dados, é fundamental. O hiperplano com a margem máxima é considerado o mais apropriado para a classificação eficaz das classes, garantindo uma separação ótima.",
  "home.page.init": "Início",
  "home.page.exoplanets": "Exoplanetas",
  "home.page.models": "Modelos",
  "home.page.telescopes": "Telescópios",
  "home.page.vision": "Visão",
  "telescope.tess.title": "Descobertas Espaciais com o Telescópio TESS",
  "telescope.tess.subtitle": "Explorando novos mundos e estrelas distantes",
  "telescope.tess.section1.h2": "1. O Olho Caçador de Exoplanetas",
  "telescope.tess.section1.p": "O Telescópio TESS é um verdadeiro caçador de exoplanetas, projetado para detectar planetas que transitam em frente às suas estrelas hospedeiras. Ele já identificou inúmeros exoplanetas em sua busca incansável.",
  "telescope.tess.section2.h2": "2. Uma Visão Abrangente do Céu",
  "telescope.tess.section2.p": "Um dos destaques do TESS é sua capacidade de observar amplas áreas do céu em busca de planetas. Ele divide o céu em setores e fotografa cada setor em detalhes, permitindo uma visão abrangente do cosmos.",
  "telescope.tess.section3.h2": "3. Estrelas Variáveis e Supernovas",
  "telescope.tess.section3.p": "O TESS não se limita apenas a procurar exoplanetas. Ele também investiga estrelas variáveis e eventos explosivos como supernovas, contribuindo para nosso entendimento de como as estrelas evoluem e mudam ao longo do tempo.",
  "telescope.tess.section4.h2": "4. Visão Além do Nosso Sistema Solar",
  "telescope.tess.section4.p": "Com suas descobertas de exoplanetas, o TESS nos oferece um vislumbre de mundos distantes, alguns dos quais podem ter condições propícias para a existência de vida. Isso amplia nossos horizontes na busca por vida extraterrestre.",
  "telescope.tess.section5.h2": "5. Inovação Tecnológica",
  "telescope.tess.section5.p": "O TESS utiliza tecnologia de ponta, incluindo câmeras de alta resolução, para capturar imagens detalhadas do espaço. Sua missão é um testemunho do avanço da tecnologia espacial.",
  "telescope.tess.p": "Com o Telescópio TESS, estamos explorando os confins do universo, revelando segredos cósmicos e expandindo nosso conhecimento do espaço infinito.",
  "telescope.k2.title": "Explorando o Universo com o Telescópio K2",
  "telescope.k2.subtitle": "Descubra os segredos do cosmos com essa incrível missão espacial",
  "telescope.k2.section1.h2": "1. Uma Segunda Chance nas Estrelas",
  "telescope.k2.section1.p": "O Telescópio K2, originalmente parte da missão Kepler, encontrou seu renascimento após uma falha nos giroscópios. Com o nome de K2, ele presta homenagem a Johannes Kepler, o célebre astrônomo.",
  "telescope.k2.section2.h2": "2. Descobrindo Mundos Distantes",
  "telescope.k2.section2.p": "O K2 tem sido um verdadeiro caçador de exoplanetas, com mais de 350 descobertas até o momento. De super-Terras a gigantes gasosos, ele nos presenteou com uma miríade de mundos além do nosso sistema solar.",
  "telescope.k2.section3.h2": "3. Em Busca da Habitabilidade",
  "telescope.k2.section3.p": "Uma das missões mais empolgantes do K2 é a busca por exoplanetas em zonas habitáveis, onde a vida poderia prosperar. Suas descobertas são um marco na exploração de vida extraterrestre.",
  "telescope.k2.section4.h2": "4. Além dos Limites Conhecidos",
  "telescope.k2.section4.p": "O K2 não se limitou apenas à caça de exoplanetas; ele examinou asteroides, estrelas variáveis, supernovas e aglomerados estelares, oferecendo um panorama completo do cosmos.",
  "telescope-kepler.title": "Desvendando o Cosmos com o Telescópio Kepler",
  "telescope-kepler.subtitle": "Explorando o universo em busca de planetas distantes",
  "telescope-kepler.section1.h2": "1. Caça aos Exoplanetas",
  "telescope-kepler.section1.p": "O Telescópio Kepler é famoso por sua missão de caçar exoplanetas. Ele descobriu milhares de planetas que orbitam outras estrelas, revelando a vastidão da diversidade planetária em nossa galáxia.",
  "telescope-kepler.section2.h2": "2. O Método do Trânsito",
  "telescope-kepler.section2.p": "O Kepler utiliza o método do trânsito para detectar exoplanetas. Ele observa a diminuição periódica do brilho de uma estrela quando um planeta passa na frente dela, permitindo a identificação de planetas que estão 'dançando' em torno de suas estrelas.",
  "telescope-kepler.section3.h2": "3. Mundos Habitáveis",
  "telescope-kepler.section3.p": "Entre as descobertas do Kepler, destacam-se exoplanetas em zonas habitáveis, onde as condições podem ser adequadas para a existência de vida. Essas descobertas alimentam nossa imaginação sobre a possibilidade de vida em outros lugares do universo.",
  "telescope-kepler.section4.h2": "4. A Caixa de Luz",
  "telescope-kepler.section4.p": "O Kepler foi projetado para manter suas câmeras em uma temperatura constante. Ele é protegido por uma 'caixa de luz' que mantém a estabilidade térmica e permite observações de alta precisão.",
  "telescope-kepler.section5.h2": "5. Missão Além das Expectativas",
  "telescope-kepler.section5.p": "Originalmente planejado para uma missão de 3,5 anos, o Kepler superou todas as expectativas e continuou operando além do seu tempo de vida projetado. Suas descobertas revolucionaram nossa compreensão do universo.",
  "telescope-kepler.section5.p2": "Graças ao Telescópio Kepler, estamos mais próximos do que nunca de responder à pergunta: 'Existem outros mundoshabitados lá fora?'",
  "Models": "Modelos",
  "graphs": "Gráficos",
  "table": "Tabela",
  "table.telescope": "Telescópio",
  "search": "Buscar",
  "DownloadData": "Download dados",
  "vision-about":"Sobre",
  "vision-about-title":"Visão",
  "vision-about-subtitle":"Representações em machine learning",
  "vision-about-sector1.p":"Em machine learning, o termo \"visão\" se refere à capacidade de um modelo de aprendizado de máquina de \"enxergar\" e interpretar padrões em dados de entrada. Isso é especialmente relevante em tarefas de visão computacional, onde o objetivo é extrair informações significativas de imagens ou vídeos. Existem visões globais e locais de dados, que serão abordados nas próximas seções.",
  "vision-about-sector2.p":"Muitas vezes, a combinação estratégica dessas abordagens é empregada em aplicações de visão computacional para maximizar a interpretação precisa de dados visuais complexos. Essa sinergia entre a visão global e local desempenha um papel crucial na capacidade dos modelos de aprendizado de máquina de entender e interagir com informações visuais em uma ampla gama de contextos.",
  "global-subtitle":"Visão geral dos dados",
  "global-section1.p":"A visão global em aprendizado de máquina está centrada na identificação de padrões e características abrangentes em uma imagem ou conjunto de dados. Essa abordagem busca extrair informações de alto nível, como contornos, formas e texturas predominantes, permitindo uma compreensão geral da cena.",
  "global-section2.p":"Ao se concentrar em características mais amplas, os modelos que utilizam visão global tendem a ser menos sensíveis a detalhes específicos ou variações sutis nos dados. Isso os torna particularmente úteis em tarefas que exigem uma percepção mais abrangente do ambiente, como reconhecimento de objetos em imagens complexas.",
  "global-section3.p":"As nossas análises de visão global das curvas de luz tem um total de 2001 pontos, que é maior que a visão local para proporcionar uma análise mais abrangente do trânsito planetário",
  "local-subtitle":"Visão específica dos dados",
  "local-section1.p":"A visão local em machine learning se concentra em detalhes específicos e características de baixo nível em uma imagem. Essa abordagem busca identificar elementos finos, como bordas nítidas, texturas pequenas ou padrões de pixels distintos.",
  "local-section2.p":"Ao analisar partes específicas da imagem em detalhes, os modelos que utilizam visão local são altamente sensíveis a variações minuciosas nos dados. Isso os torna especialmente eficazes em tarefas que exigem uma compreensão detalhada da estrutura da imagem, como a detecção de características específicas ou a segmentação de objetos em uma cena. Para a visão local, utilizaremos um tamanho fixo de 201 pontos para as curvas de luz.",
  "vision-modal-input-file":"Visão",
  "modal-show-info-model":"Métricas de Avaliação:",
  "modal-show-info-model-matriz":"MATRIZ DE CONFUSÃO",
  "modal-show-info-model-metricas":"MÉTRICAS",
  "select-model-search": "Buscar",
  "select-model-models":"Modelo",
  "select-model-vision":"Visão",
  "select-model-telescope":"Telescópio",
  "select-model-targets":"Targets",
  "select-model-info":"INFO",
  "select-model-clean":"Limpar",
  "select-model-submit":"Executar",
  "select-mode-table-model":"Modelo",
  "select-mode-table-vision":"Visão",
  "select-mode-table-telescope":"Telescópio",
  "select-mode-table-prob":"Probabilidade",
  "select-mode-table-graph":"Gráfico"

}
